In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'key1': ['a','a','b','b','a'],
    'key2': ['one','two','one','two','one'],
    'data1': np.random.randn(5),
    'data2': np.random.randn(5)
})
df

  key1 key2     data1     data2
0    a  one -1.477442  1.390936
1    a  two -0.668600  1.411249
2    b  one  1.038255  1.061416
3    b  two -1.153492  1.777507
4    a  one  0.275261  0.641114

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.623594
b   -0.057619
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.601091
      two    -0.668600
b     one     1.038255
      two    -1.153492
Name: data1, dtype: float64

In [6]:
df['data1'].groupby([df['key2'],df['key1']]).mean()

key2  key1
one   a      -0.601091
      b       1.038255
two   a      -0.668600
      b      -1.153492
Name: data1, dtype: float64

In [7]:
means.unstack()

key2       one       two
key1
a    -0.601091 -0.668600
b     1.038255 -1.153492

In [8]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])
years = np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005   -0.668600
            2006    1.038255
Ohio        2005   -1.315467
            2006    0.275261
Name: data1, dtype: float64

### On DataFrame

In [9]:
df.groupby('key1').mean() #observe the object here is DataFrame not series

         data1     data2
key1
a    -0.623594  1.147766
b    -0.057619  1.419461

In [10]:
df.groupby('key1').size()

key1
a    3
b    2
dtype: int64

In [11]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.601091  1.016025
     two  -0.668600  1.411249
b    one   1.038255  1.061416
     two  -1.153492  1.777507

In [12]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

# Iterating over Groups

In [13]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)
    print('*********************************')

a
  key1 key2     data1     data2
0    a  one -1.477442  1.390936
1    a  two -0.668600  1.411249
4    a  one  0.275261  0.641114
*********************************
b
  key1 key2     data1     data2
2    b  one  1.038255  1.061416
3    b  two -1.153492  1.777507
*********************************

In [14]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)
    print('****************************')

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.477442  1.390936
4    a  one  0.275261  0.641114
****************************
('a', 'two')
  key1 key2   data1     data2
1    a  two -0.6686  1.411249
****************************
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.038255  1.061416
****************************
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.153492  1.777507
****************************

In [15]:
piecies = dict(list(df.groupby('key1')))
piecies

{'a':   key1 key2     data1     data2
 0    a  one -1.477442  1.390936
 1    a  two -0.668600  1.411249
 4    a  one  0.275261  0.641114, 'b':   key1 key2     data1     data2
 2    b  one  1.038255  1.061416
 3    b  two -1.153492  1.777507}

In [16]:
piecies['b']

  key1 key2     data1     data2
2    b  one  1.038255  1.061416
3    b  two -1.153492  1.777507

#### By default Grouping done on axis 0

In [17]:
grouped = df.groupby(df.dtypes,axis=1)
for dtype,group in grouped:
    print(dtype)
    print(group)
    print('*********************')

float64
      data1     data2
0 -1.477442  1.390936
1 -0.668600  1.411249
2  1.038255  1.061416
3 -1.153492  1.777507
4  0.275261  0.641114
*********************
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one
*********************

# Selecting a column or Subset of columns

In [18]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.016025
     two   1.411249
b    one   1.061416
     two   1.777507

In [19]:
df[['data2']].groupby([df['key1'],df['key2']]).mean()

              data2
key1 key2
a    one   1.016025
     two   1.411249
b    one   1.061416
     two   1.777507

In [20]:
s_grouped = df.groupby(['key1','key2'])['data1']
s_grouped #Grouped DataFrame

In [21]:
s_grouped.mean()

key1  key2
a     one    -0.601091
      two    -0.668600
b     one     1.038255
      two    -1.153492
Name: data1, dtype: float64

# Grouping with Dict and Series

In [22]:
people = pd.DataFrame(np.random.randn(5,5),index=['Joe','Steve','Wes','Jim','Travis'],columns=['a','b','c','d','e'])
people.iloc[2:3,[1,2]]=np.nan
people

               a         b         c         d         e
Joe     0.051167  0.531479 -0.270982  0.571228 -1.609997
Steve  -1.168932  1.222977  0.184076 -0.003564 -1.659923
Wes    -0.637734       NaN       NaN  0.482302  0.931328
Jim    -0.437941  0.920875  1.099547 -1.301546  1.105375
Travis  0.371937 -1.633076  1.298511 -0.665364 -1.683144

In [23]:
mapping = {
    'a':'red',
    'b':'red',
    'c':'blue',
    'd':'blue',
    'e':'red',
    'f':'orange'
}

In [24]:
by_column = people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe     0.300246 -1.027352
Steve   0.180512 -1.605879
Wes     0.482302  0.293594
Jim    -0.201999  1.588309
Travis  0.633147 -2.944283

In [25]:
# Same can be achieved with series
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [26]:
people.groupby(map_series,axis=1).sum()

            blue       red
Joe     0.300246 -1.027352
Steve   0.180512 -1.605879
Wes     0.482302  0.293594
Jim    -0.201999  1.588309
Travis  0.633147 -2.944283

# Group with Functions

In [27]:
people.groupby(len).sum() #The LEN fucntion acts on the INDEX

          a         b         c         d         e
3 -1.024508  1.452354  0.828565 -0.248017  0.426705
5 -1.168932  1.222977  0.184076 -0.003564 -1.659923
6  0.371937 -1.633076  1.298511 -0.665364 -1.683144

In [28]:
key_list = ['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.637734  0.531479 -0.270982  0.482302 -1.609997
  two -0.437941  0.920875  1.099547 -1.301546  1.105375
5 one -1.168932  1.222977  0.184076 -0.003564 -1.659923
6 two  0.371937 -1.633076  1.298511 -0.665364 -1.683144

# Grouping by Index Levels

In [29]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]], names=['cty','tenor'])
hier_df = pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.151950  1.386110  1.107091 -0.506396  0.251348
1     -0.538251  0.377048 -0.539942  0.170487  0.194943
2      0.870710  1.801046 -0.772678 -0.968263  0.198654
3     -0.418967  0.095761  0.277328 -0.644604  0.065333

In [30]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3